#include <iostream>
#include <array>
#include <ctime>
#include <Windows.h>
#include "prototypes.h"
#include "termcolor.hpp"
#include <cwctype> 


using Slova = std::array < std::string, 100>;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	setlocale(LC_ALL, "ru");

	srand(time(0));

	Slova slova = {"авокадо", "банан", "велосипед", "гитара", "дом", "еж", "Єлка", "жираф", "замок", 
				   "икра", "кот", "луна", "море", "носок", "опера", "пицца", "ракета", "солнце", "телефон", 
				   "улитка", "фонарь", "хлеб", "цветок", "часы", "шоколад", "щенок", "ымба", "экран", "юла", 
				   "€блоко", "акула", "бабочка", "воздушный", "глаз", "дерево", "ежевика", "Єрш", "жемчуг", 
				   "зонт", "изюм", "корова", "лампа", "молоко", "ноутбук", "оранжевый", "пыльца", "рюкзак", 
				   "самолет", "танцор", "улица", "флаг", "холодильник", "цирк", "чашка", "шапка", "щит", "этюд", 
				   "юла", "€хта", "азбука", "береза", "вишн€", "гриб", "джинсы", "ежевичный", "Ємкость", "жук", 
				   "звезда", "индейка", "космос", "л€гушка", "морковь", "нож", "обезь€на", "птица", "робот", "собака", 
				   "телевизор", "ухо", "фрукты", "хом€к", "цапл€", "черепаха", "шампунь", "щука" };
	

	mainMenu(slova);

	return EXIT_SUCCESS;
}